Tekla Open API Reference for Tekla Structures 2025
UnitAttributes Constructor (Units, FormatTypes)
 Creates a new UnitAttributes attributes instance with the given parameters.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public UnitAttributes(
	Units unit,
	FormatTypes format
)
Public Sub New (
	unit As Units,
	format As FormatTypes
)
Parameters
unit
Type: Tekla.Structures.Drawing.Units
The units to use.
format
Type: Tekla.Structures.Drawing.FormatTypes
The format to use.
See Also
Reference
UnitAttributes Class
UnitAttributes Overload
Tekla.Structures.Drawing Namespace